пк("MSI-b450","I5-11400f","XFX-650",["RTX2060Ti","GTX1070Ti","GTX1080Ti"],["Стекло","Пластик","Стенд"],[2666,3000,3200,3600]).
пк("Aourus-x570","R7-5700x","SuperFlower-850",["RTX3080Ti","RX7800XT","GTXTitan"],["Стекло","Пластик","Стенд"],[3000,3200,3400,3600]).
пк("AsRock-a320","I3-11200","MSI-550",["RX6600xt","GTX1660Supper","RTX3050"],["Стекло","Пластик","Стенд"],[2400,2666,2800,3000]).
пк("Asus-x470","I7-10700f","Seasonic-850",["RTX3080Ti","GTX1080Ti","RTX2090"],["Стекло","Пластик","Стенд"],[3000,3200,3400,3600]).
пк("Gigabyte-B450","R55500U","FSP-650",["GTX1070Ti","GTX1660Ti","RX6700"],["Стекло","Пластик","Стенд"],[2666,3000,3200,3600]).

сборка(Пк,Мп,Бп):-
	пк(Мп,_,Бп,Вк,_,_),
	Пк = [Мп,Бп,Вк].
набор(Нб,Мп,Цп):-
	пк(Мп,Цп,_,["GTX1070Ti",_,_],["Стекло", "Пластик",_],_),
	Нб = [Мп,["GTX1070Ti"],["Стекло", "Пластик"]].
нагрузка(Мп,Цп,Озу):-
	пк(Мп,Цп,_,["RTX3080Ti",_,_],_,_),
	Озу = [3000|3600].